MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.h
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_pcd.h
  * @brief   Header file for the PCD HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_HAL_PCD_H
#define STM32C5XX_HAL_PCD_H

#ifdef __cplusplus
extern "C" {
#endif /* defined __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_usb_drd_core.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined (USB_DRD_FS)
/** @defgroup PCD USB Peripheral Controller Driver
  * @{
  */
/* Private constants ---------------------------------------------------------*/
/** @defgroup PCD_Private_Constants Private Constants
  * @{
  */

/**
  * @brief  USE HAL PCD USB EP TYPE ISOC.
  */
#ifndef USE_HAL_PCD_USB_EP_TYPE_ISOC
#define USE_HAL_PCD_USB_EP_TYPE_ISOC                                         1U
#endif /* USE_HAL_PCD_USB_EP_TYPE_ISOC */

/**
  * @brief  USE HAL PCD USB BCD.
  */
#ifndef USE_HAL_PCD_USB_BCD
#define USE_HAL_PCD_USB_BCD                                                  0U
#endif /* USE_HAL_PCD_USB_BCD */

/**
  * @brief  USE HAL PCD USB LPM.
  */
#ifndef USE_HAL_PCD_USB_LPM
#define USE_HAL_PCD_USB_LPM                                                  0U
#endif /* USE_HAL_PCD_USB_LPM */

/**
  * @brief  USE HAL PCD USB DOUBLE BUFFER.
  */
#ifndef USE_HAL_PCD_USB_DOUBLE_BUFFER
#define USE_HAL_PCD_USB_DOUBLE_BUFFER                                        1U
#endif /* USE_HAL_PCD_USB_DOUBLE_BUFFER */

/**
  * @brief  USE HAL PCD MAX ENDPOINT NB.
  */
#ifndef USE_HAL_PCD_MAX_ENDPOINT_NB
#define USE_HAL_PCD_MAX_ENDPOINT_NB                                          8U
#endif /* USE_HAL_PCD_MAX_ENDPOINT_NB */


/**
  * @brief  HAL USB PCD WAKEUP EXTI LINE.
  */
#define USB_WAKEUP_EXTI_LINE                                          (0x1U << 0U)

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup PCD_Private_Macros Private Macros
  * @{
  */
/*! Macro to get the min value */
#define PCD_MIN(a,b) (((a) < (b)) ? (a) : (b))

/*! Macro to get the max value */
#define PCD_MAX(a,b) (((a) > (b)) ? (a) : (b))
/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup PCD_Exported_Constants Exported Constants
  * @{
  */
#if defined (USE_HAL_PCD_GET_LAST_ERRORS) && (USE_HAL_PCD_GET_LAST_ERRORS == 1)
/** @defgroup PCD_Error_Codes Error Codes
  * @{
  */
#define HAL_PCD_ERROR_NONE                          (0x0U)           /*!< No error                   */
#define HAL_PCD_ERROR_BCD                           (0x1U << 0U)     /*!< USB Battery Charging error */
#define HAL_PCD_ERROR_IN_EP_AHB                     (0x1U << 1U)     /*!< USB IN EP AHB error        */
#define HAL_PCD_ERROR_IN_EP_TIMEOUT                 (0x1U << 2U)     /*!< USB IN EP TIMEOUT error    */
#define HAL_PCD_ERROR_IN_EP_BABBLE                  (0x1U << 3U)     /*!< USB IN EP BABBLE error     */
#define HAL_PCD_ERROR_OUT_EP_AHB                    (0x1U << 4U)     /*!< USB OUT EP AHB error       */
#define HAL_PCD_ERROR_OUT_EP_PACKET                 (0x1U << 5U)     /*!< USB OUT EP PACKET  error   */
#define HAL_PCD_ERROR_CTR_STUCK                     (0x1U << 6U)     /*!< USB Transaction error      */
#define HAL_PCD_ERROR_EP_INDEX                      (0x1U << 7U)     /*!< USB Endpoint index error   */

/**
  * @}
  */
#endif /* USE_HAL_PCD_GET_LAST_ERRORS */
#define HAL_PCD_EP_ADDR_MSK                         (0x7FU)          /*!< Endpoint Address Mask      */
#define HAL_PCD_EP_IN_DIR              (USB_CORE_EP_IN_DIR)          /*!< Endpoint IN direction      */
#define HAL_PCD_EP_OUT_DIR            (USB_CORE_EP_OUT_DIR)          /*!< Endpoint OUT direction     */
#define HAL_PCD_SNG_BUF                   (USB_DRD_SNG_BUF)          /*!< USB Endpoint single buffer */
#define HAL_PCD_DBL_BUF                   (USB_DRD_DBL_BUF)          /*!< USB Endpoint double buffer */
/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup PCD_Exported_Types Exported Types
  * @{
  */

/**
  * @brief HAL USB Instance definition.
  */
typedef enum
{
  HAL_PCD_DRD_FS = USB_DRD_FS_BASE, /*!< USB DRD FS Instance */
} hal_pcd_t;

/**
  * @brief  HAL USB PCD State structure definition.
  */
typedef enum
{
  HAL_PCD_STATE_RESET     = 0U,            /*!< HAL PCD STATE RESET */
  HAL_PCD_STATE_INIT      = (1U << 31U),   /*!< HAL PCD STATE INIT  */
  HAL_PCD_STATE_IDLE      = (1U << 30U),   /*!< HAL PCD STATE IDLE  */
  HAL_PCD_STATE_ACTIVE    = (1U << 29U),   /*!< HAL PCD STATE ACTIVE */
  HAL_PCD_STATE_XFR_ABORT = (1U << 28U),   /*!< HAL PCD STATE TRANSFER ABORT */
  HAL_PCD_STATE_FAULT     = (1U << 27U),   /*!< HAL PCD STATE FAULT */
} hal_pcd_state_t;


/**
  * @brief HAL USB PCD Device State Options.
  */
typedef enum
{
  HAL_PCD_PORT_STATE_DEV_DISCONNECT = (1U << 31U),   /*!< HAL PCD PORT STATE Device DISCONNECT */
  HAL_PCD_PORT_STATE_DEV_CONNECT    = (1U << 30U),   /*!< HAL PCD PORT STATE Device CONNECT    */
  HAL_PCD_PORT_STATE_DEV_RESET      = (1U << 29U),   /*!< HAL PCD PORT STATE Device RESET      */
  HAL_PCD_PORT_STATE_DEV_RUN        = (1U << 28U),   /*!< HAL PCD PORT STATE Device RUN        */
  HAL_PCD_PORT_STATE_DEV_SUSPEND    = (1U << 27U),   /*!< HAL PCD PORT STATE Device SUSPEND    */
  HAL_PCD_PORT_STATE_DEV_RESUME     = (1U << 26U),   /*!< HAL PCD PORT STATE Device RESUME     */
} hal_pcd_port_state_t;


#if defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1)
/**
  * @brief  HAL USB PCD LPM State structure definition.
  */
typedef enum
{
  HAL_PCD_LPM_STATE_L0     = (1U << 31U),   /*!< PCD LPM STATE L0: on      */
  HAL_PCD_LPM_STATE_L1     = (1U << 30U),   /*!< PCD LPM STATE L1: sleep   */
} hal_pcd_lpm_state_t;
