MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.h
#endif /* defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1) */


/**
  * @brief  HAL USB PCD LPM message structure definition.
  */
typedef enum
{
  HAL_PCD_LPM_L0_ACTIVE = 0x00U, /*!< PCD LPM ACTIVE STATE L0: on    */
  HAL_PCD_LPM_L1_ACTIVE = 0x01U, /*!< PCD LPM ACTIVE STATE L1: sleep */
} hal_pcd_lpm_active_status_t;


/**
  * @brief  HAL USB PCD BCD State structure definition.
  */
typedef enum
{
  HAL_PCD_BCD_STD_DOWNSTREAM_PORT       = USB_CORE_BCD_PORT_STATUS_STD_DOWNSTREAM,        /*!< PCD BCD STANDARD DOWNSTREAM PORT */
  HAL_PCD_BCD_CHARGING_DOWNSTREAM_PORT  = USB_CORE_BCD_PORT_STATUS_CHARGING_DOWNSTREAM,   /*!< PCD BCD CHARGING DOWNSTREAM PORT */
  HAL_PCD_BCD_DEDICATED_CHARGING_PORT   = USB_CORE_BCD_PORT_STATUS_DEDICATED_CHARGING,    /*!< PCD BCD DEDICATED CHARGING PORT  */
  HAL_PCD_BCD_DISCOVERY_COMPLETED       = 0xFEU,                                          /*!< PCD BCD DISCOVERY COMPLETED      */
  HAL_PCD_BCD_ERROR                     = 0xFFU,                                          /*!< PCD BCD ERROR                    */
} hal_pcd_bcd_port_type_t;


#if defined (USE_HAL_PCD_USB_BCD) && (USE_HAL_PCD_USB_BCD == 1)
/**
  * @brief  HAL USB BCD Structure definition.
  */
typedef enum
{
  HAL_PCD_BCD_PORT_STATUS_DEFAULT             = USB_CORE_BCD_PORT_STATUS_DEFAULT,               /*!< USB PCD Default BCD Status Port  */
  HAL_PCD_BCD_PORT_STATUS_NOT_STD_DOWNSTREAM  = USB_CORE_BCD_PORT_STATUS_NOT_STD_DOWNSTREAM,    /*!< USB PCD NOT STD Downstream Port  */
  HAL_PCD_BCD_PORT_STATUS_STD_DOWNSTREAM      = USB_CORE_BCD_PORT_STATUS_STD_DOWNSTREAM,        /*!< USB PCD STD Downstream Port      */
  HAL_PCD_BCD_PORT_STATUS_DEDICATED_CHARGING  = USB_CORE_BCD_PORT_STATUS_DEDICATED_CHARGING,    /*!< USB PCD Dedicated Charging Port  */
  HAL_PCD_BCD_PORT_STATUS_CHARGING_DOWNSTREAM = USB_CORE_BCD_PORT_STATUS_CHARGING_DOWNSTREAM,   /*!< USB PCD Charging Downstream Port */
} hal_pcd_bcd_port_status_t;
#endif /* defined (USE_HAL_PCD_USB_BCD) && (USE_HAL_PCD_USB_BCD == 1) */


/**
  * @brief  HAL USB PCD Speed structure definition.
  */
typedef enum
{
  HAL_PCD_SPEED_FS       = USB_CORE_SPEED_FS,         /*!< HAL PCD SPEED FULL SPEED               */
} hal_pcd_speed_t;


/**
  * @brief  HAL USB PCD Device Speed structure definition.
  */
typedef enum
{
  HAL_PCD_DEVICE_SPEED_FS    = USB_CORE_DEVICE_SPEED_FS,            /*!< HAL PCD DEVICE FULL SPEED    */
  HAL_PCD_DEVICE_SPEED_ERROR = USB_CORE_DEVICE_SPEED_ERROR          /*!< HAL PCD DEVICE SPEED ERROR   */
} hal_pcd_device_speed_t;


/**
  * @brief  HAL USB PCD PHY Module structure definition.
  */
typedef enum
{
  HAL_PCD_PHY_EMBEDDED_FS   = USB_CORE_PHY_EMBEDDED_FS,     /*!< PCD PHY EMBEDDED */
} hal_pcd_phy_module_t;


/**
  * @brief  HAL USB PCD DMA status definition.
  */
typedef enum
{
  HAL_PCD_DMA_DISABLED = USB_CORE_CONFIG_DISABLED,   /*!< HAL PCD DMA DISABLED */
  HAL_PCD_DMA_ENABLED  = USB_CORE_CONFIG_ENABLED,    /*!< HAL PCD DMA ENABLED  */
} hal_pcd_dma_status_t;


/**
  * @brief  HAL USB PCD SOF status definition.
  */
typedef enum
{
  HAL_PCD_SOF_DISABLED = USB_CORE_CONFIG_DISABLED,   /*!< HAL PCD SOF DISABLED */
  HAL_PCD_SOF_ENABLED  = USB_CORE_CONFIG_ENABLED,    /*!< HAL PCD SOF ENABLED  */
} hal_pcd_sof_status_t;


/**
  * @brief  HAL USB PCD Low Power Management status definition.
  */
typedef enum
{
  HAL_PCD_LPM_DISABLED = USB_CORE_CONFIG_DISABLED,   /*!< HAL PCD Low Power Management DISABLED */
  HAL_PCD_LPM_ENABLED  = USB_CORE_CONFIG_ENABLED,    /*!< HAL PCD Low Power Management ENABLED  */
} hal_pcd_lpm_status_t;


/**
  * @brief  HAL USB PCD Battery Charging status definition.
  */
typedef enum
{
  HAL_PCD_BCD_DISABLED = USB_CORE_CONFIG_DISABLED,   /*!< HAL PCD USB Battery Charging DISABLED */
  HAL_PCD_BCD_ENABLED  = USB_CORE_CONFIG_ENABLED,    /*!< HAL PCD USB Battery Charging ENABLED  */
} hal_pcd_bcd_status_t;


/**
  * @brief  HAL USB PCD Vbus Sensing status definition.
  */
typedef enum
{
  HAL_PCD_VBUS_SENSE_DISABLED = USB_CORE_CONFIG_DISABLED,   /*!< HAL PCD USB Vbus sensing DISABLED */
  HAL_PCD_VBUS_SENSE_ENABLED  = USB_CORE_CONFIG_ENABLED,    /*!< HAL PCD USB Vbus sensing ENABLED  */
} hal_pcd_vbus_sense_status_t;


/**
  * @brief  HAL USB PCD bulk double buffer status definition.
  */
typedef enum
{
  HAL_PCD_BULK_DB_DISABLED = USB_CORE_CONFIG_DISABLED,   /*!< HAL PCD USB Bulk Double buffer mode DISABLED */
  HAL_PCD_BULK_DB_ENABLED  = USB_CORE_CONFIG_ENABLED,    /*!< HAL PCD USB Bulk Double buffer mode ENABLED  */
} hal_pcd_bulk_db_status_t;


/**
  * @brief  HAL USB PCD Endpoint Type structure definition.
  */
typedef enum
{
  HAL_PCD_EP_TYPE_CTRL = USB_CORE_EP_TYPE_CTRL,
  HAL_PCD_EP_TYPE_ISOC = USB_CORE_EP_TYPE_ISOC,
  HAL_PCD_EP_TYPE_BULK = USB_CORE_EP_TYPE_BULK,
  HAL_PCD_EP_TYPE_INTR = USB_CORE_EP_TYPE_INTR,
} hal_pcd_ep_type_t;


/**
  * @brief  HAL USB PCD Instance configuration Structure definition.
  */
typedef struct
{
  hal_pcd_dma_status_t dma_enable;                         /*!< USB DMA state                                         */

  hal_pcd_speed_t pcd_speed;                               /*!< USB PCD core speed                                    */

  hal_pcd_phy_module_t phy_interface;                      /*!< PHY interface                                         */

  hal_pcd_sof_status_t sof_enable;                         /*!< SOF signal output enable status                       */

  hal_pcd_lpm_status_t lpm_enable;                         /*!< Link power management enable status                   */

  hal_pcd_bcd_status_t battery_charging_enable;            /*!< Battery charging enable status                        */

  hal_pcd_vbus_sense_status_t vbus_sensing_enable;         /*!< VBUS sensing enable status                            */

  hal_pcd_bulk_db_status_t bulk_doublebuffer_enable;       /*!< Bulk endpoint double buffer mode enable status        */
} hal_pcd_config_t;

typedef usb_core_ep_t             hal_pcd_ep_t;     /*!< PCD endpoint structure type */
typedef struct hal_pcd_handle_s   hal_pcd_handle_t; /*!< PCD handle structure type */

#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
/**
  * @brief pointer to a PCD callback function.
  */
typedef void (*hal_pcd_cb_t)(hal_pcd_handle_t *hpcd);

/**
  * @brief pointer to a data callback function.
  */
typedef void (*hal_pcd_data_cb_t)(hal_pcd_handle_t *hpcd, uint8_t ep_num);

/**
  * @brief pointer to an iso callback function.
  */
typedef void (*hal_pcd_iso_cb_t)(hal_pcd_handle_t *hpcd, uint8_t ep_num);

/**
  * @brief pointer to an LPM callback function.
  */
typedef void (*hal_pcd_lpm_cb_t)(hal_pcd_handle_t *hpcd, hal_pcd_lpm_active_status_t lpm_status);

/**
  * @brief pointer to a BCD callback function.
  */
typedef void (*hal_pcd_bcd_cb_t)(hal_pcd_handle_t *hpcd, hal_pcd_bcd_port_type_t port_type);

