MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.h
#endif /* (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U) */


/**
  * @brief  HAL USB PCD Handle Structure definition.
  */
struct hal_pcd_handle_s
{
  hal_pcd_t instance;                                      /*!< Register base address                                 */
  volatile hal_pcd_state_t global_state;                   /*!< PCD communication state                               */
  volatile hal_pcd_port_state_t device_state;              /*!< PCD Port Device state                                 */

#if defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1)
  volatile hal_pcd_lpm_state_t lpm_state;                  /*!< LPM State                                             */
#endif /* defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1) */
  volatile uint8_t usb_address;                            /*!< USB Device Address                                    */

#if defined (USE_HAL_PCD_GET_LAST_ERRORS) && (USE_HAL_PCD_GET_LAST_ERRORS == 1)
  volatile uint32_t last_error_codes;                      /*!< Errors limited to the last process
                                                                This parameter can be a combination of
                                                                @ref PCD_Error_Codes                                  */
#endif /* USE_HAL_PCD_GET_LAST_ERRORS */

  uint8_t endpoints_nbr;                                   /*!< Number of device endpoints
                                                                This parameter depends on the used USB core.          */

  uint32_t setup[12];                                      /*!< Setup packet buffer                                   */
  uint8_t *p_setup;                                        /*!< Setup packet buffer pointer                           */

  hal_pcd_ep_t in_ep[USE_HAL_PCD_MAX_ENDPOINT_NB];         /*!< IN endpoint parameters                                */
  hal_pcd_ep_t out_ep[USE_HAL_PCD_MAX_ENDPOINT_NB];        /*!< OUT endpoint parameters                               */

  usb_core_mode_t current_mode;                            /*!< store Current Mode                                    */

  hal_pcd_lpm_status_t lpm_active;                         /*!< Link power management active status
                                                                This parameter can be set to ENABLE or DISABLE        */
  uint32_t lpm_besl;                                       /*!< Best Effort Service Latency                           */

  hal_pcd_bcd_status_t battery_charging_active;            /*!< Battery charging active status
                                                                This parameter can be set to ENABLE or DISABLE        */

  usb_core_pcd_driver_t driver;                            /*!< USB low layer driver                                  */
  void (* p_irq_handler)(struct hal_pcd_handle_s *hpcd);   /*!< USB instance interrupt handler                        */

#if defined (USE_HAL_PCD_USER_DATA) && (USE_HAL_PCD_USER_DATA == 1)
  const void *p_user_data;                                 /*!< User Data Pointer                                     */
#endif /* USE_HAL_PCD_USER_DATA */

#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)

  hal_pcd_cb_t p_sof_cb;                                   /*!< USB HAL PCD SOF callback                              */
  hal_pcd_cb_t p_setup_stage_cb;                           /*!< USB HAL PCD Setup Stage callback                      */
  hal_pcd_cb_t p_reset_cb;                                 /*!< USB HAL PCD Reset callback                            */
  hal_pcd_cb_t p_suspend_cb;                               /*!< USB HAL PCD Suspend callback                          */
  hal_pcd_cb_t p_resume_cb;                                /*!< USB HAL PCD Resume callback                           */
  hal_pcd_cb_t p_connect_cb;                               /*!< USB HAL PCD Connect callback                          */
  hal_pcd_cb_t p_disconnect_cb;                            /*!< USB HAL PCD Disconnect callback                       */
  hal_pcd_data_cb_t p_data_out_stage_cb;                   /*!< USB HAL PCD Data OUT Stage callback                   */
  hal_pcd_data_cb_t p_data_in_stage_cb;                    /*!< USB HAL PCD Data IN Stage callback                    */
  hal_pcd_iso_cb_t p_iso_out_incomplete_cb;                /*!< USB HAL PCD ISO OUT Incomplete callback               */
  hal_pcd_iso_cb_t p_iso_in_incomplete_cb;                 /*!< USB HAL PCD ISO IN Incomplete callback                */
  hal_pcd_cb_t p_error_cb;                                 /*!< USB HAL PCD Error callback                            */
  hal_pcd_data_cb_t p_ep_abort_transfer_cb;                /*!< USB HAL PCD Endpoint Abort Transfer callback          */
  hal_pcd_bcd_cb_t p_battery_charging_cb;                  /*!< USB HAL PCD Battery charging callback                 */
  hal_pcd_lpm_cb_t p_low_power_management_cb;              /*!< USB HAL PCD USB Link Power management callback        */
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */
};

/**
  * @}
  */

/* Exported macros -----------------------------------------------------------*/
/** @defgroup PCD_Exported_Macros Exported Macros
  * @{
  */

/**
  * @brief  HAL USB PCD WAKEUP EXTI line enable.
  */
#define HAL_PCD_USB_WAKEUP_EXTI_ENABLE_IT()                         (EXTI->IMR2 |= USB_WAKEUP_EXTI_LINE)

/**
  * @brief  HAL USB PCD WAKEUP EXTI line disable.
  */
#define HAL_PCD_USB_WAKEUP_EXTI_DISABLE_IT()                        (EXTI->IMR2 &= ~USB_WAKEUP_EXTI_LINE)
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup PCD_Exported_Functions Exported Functions
  * @{
  */

/** @defgroup PCD_Exported_Functions_Group1 Initialization and deinitialization functions
  * @{
  */
hal_status_t HAL_PCD_Init(hal_pcd_handle_t *hpcd, hal_pcd_t instance);
void         HAL_PCD_DeInit(hal_pcd_handle_t *hpcd);
/**
  * @}
  */

/** @defgroup PCD_Exported_Functions_Group2 Global Configuration functions
  * @{
  */

hal_status_t HAL_PCD_SetConfig(hal_pcd_handle_t *hpcd, const hal_pcd_config_t *p_config);

/**
  * @}
  */

/** @defgroup PCD_Exported_Functions_Group3 User Data functions
  * @{
  */
#if defined (USE_HAL_PCD_GET_LAST_ERRORS) && (USE_HAL_PCD_GET_LAST_ERRORS == 1)
uint32_t HAL_PCD_GetLastErrorCodes(const hal_pcd_handle_t *hpcd);
#endif /* USE_HAL_PCD_GET_LAST_ERRORS */

#if defined (USE_HAL_PCD_USER_DATA) && (USE_HAL_PCD_USER_DATA == 1)
void        HAL_PCD_SetUserData(hal_pcd_handle_t *hpcd, const void *p_user_data);
const void *HAL_PCD_GetUserData(const hal_pcd_handle_t *hpcd);
#endif /* USE_HAL_PCD_USER_DATA */

/**
  * @}
  */

