MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pcd.h
/** @defgroup PCD_Exported_Functions_Group4 Peripheral Control functions
  * @{
  */
hal_status_t HAL_PCD_Start(hal_pcd_handle_t *hpcd);
hal_status_t HAL_PCD_Stop(hal_pcd_handle_t *hpcd);


#if defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1)
hal_status_t HAL_PCD_LPM_Start(hal_pcd_handle_t *hpcd);
hal_status_t HAL_PCD_LPM_Stop(hal_pcd_handle_t *hpcd);
#endif /* defined (USE_HAL_PCD_USB_LPM) && (USE_HAL_PCD_USB_LPM == 1) */


#if defined (USE_HAL_PCD_USB_BCD) && (USE_HAL_PCD_USB_BCD == 1)
hal_status_t HAL_PCD_BCD_PortTypeDetection(hal_pcd_handle_t *hpcd);
hal_status_t HAL_PCD_BCD_Start(hal_pcd_handle_t *hpcd);
hal_status_t HAL_PCD_BCD_Stop(hal_pcd_handle_t *hpcd);
#endif /* defined (USE_HAL_PCD_USB_BCD) && (USE_HAL_PCD_USB_BCD == 1) */

hal_status_t HAL_PCD_DeviceConnect(const hal_pcd_handle_t *hpcd);
hal_status_t HAL_PCD_DeviceDisconnect(const hal_pcd_handle_t *hpcd);
hal_pcd_device_speed_t HAL_PCD_GetDeviceSpeed(const hal_pcd_handle_t *hpcd);
hal_status_t HAL_PCD_SetDeviceAddress(hal_pcd_handle_t *hpcd, uint8_t address);
hal_status_t HAL_PCD_OpenEndpoint(hal_pcd_handle_t *hpcd, uint8_t ep_addr, uint16_t ep_mps, hal_pcd_ep_type_t ep_type);
hal_status_t HAL_PCD_CloseEndpoint(hal_pcd_handle_t *hpcd, uint8_t ep_addr);
hal_status_t HAL_PCD_FlushEndpoint(const hal_pcd_handle_t *hpcd, uint8_t ep_addr);

hal_status_t HAL_PCD_SetEndpointReceive(hal_pcd_handle_t *hpcd, uint8_t ep_addr, uint8_t *p_buffer, uint32_t size_byte);
hal_status_t HAL_PCD_SetEndpointTransmit(hal_pcd_handle_t *hpcd, uint8_t ep_addr,
                                         uint8_t *p_buffer, uint32_t size_byte);

hal_status_t HAL_PCD_SetEndpointStall(hal_pcd_handle_t *hpcd, uint8_t ep_addr);
hal_status_t HAL_PCD_ClearEndpointStall(hal_pcd_handle_t *hpcd, uint8_t ep_addr);
hal_status_t HAL_PCD_AbortEndpointTransfer(hal_pcd_handle_t *hpcd, uint8_t ep_addr);
uint32_t HAL_PCD_EP_GetRxCount(const hal_pcd_handle_t *hpcd, uint8_t ep_addr);

hal_status_t HAL_PCD_RemoteWakeup_Start(const hal_pcd_handle_t *hpcd);
hal_status_t HAL_PCD_RemoteWakeup_Stop(const hal_pcd_handle_t *hpcd);

hal_status_t HAL_PCD_PMAConfig(hal_pcd_handle_t *hpcd, uint16_t ep_addr, uint16_t ep_kind, uint32_t pma_address);

/**
  * @}
  */

/** @defgroup PCD_Exported_Functions_Group5 Peripheral State functions
  * @{
  */
hal_pcd_state_t HAL_PCD_GetState(const hal_pcd_handle_t *hpcd);
/**
  * @}
  */

/** @defgroup PCD_Exported_Functions_Group6 IRQ handling functions
  * @{
  */

void HAL_PCD_IRQHandler(hal_pcd_handle_t *hpcd);


void HAL_PCD_DRD_IRQHandler(hal_pcd_handle_t *hpcd);


/**
  * @}
  */

/** @defgroup PCD_Exported_Functions_Group7 Default Callbacks functions
  * @{
  */

void HAL_PCD_SofCallback(hal_pcd_handle_t *hpcd);
void HAL_PCD_SetupStageCallback(hal_pcd_handle_t *hpcd);
void HAL_PCD_ResetCallback(hal_pcd_handle_t *hpcd);
void HAL_PCD_SuspendCallback(hal_pcd_handle_t *hpcd);
void HAL_PCD_ResumeCallback(hal_pcd_handle_t *hpcd);
void HAL_PCD_ConnectCallback(hal_pcd_handle_t *hpcd);
void HAL_PCD_DisconnectCallback(hal_pcd_handle_t *hpcd);
void HAL_PCD_DataOutStageCallback(hal_pcd_handle_t *hpcd, uint8_t ep_num);
void HAL_PCD_DataInStageCallback(hal_pcd_handle_t *hpcd, uint8_t ep_num);
void HAL_PCD_ISOOUTIncompleteCallback(hal_pcd_handle_t *hpcd, uint8_t ep_num);
void HAL_PCD_ISOINIncompleteCallback(hal_pcd_handle_t *hpcd, uint8_t ep_num);
void HAL_PCD_LpmCallback(hal_pcd_handle_t *hpcd, hal_pcd_lpm_active_status_t lpm_status);
void HAL_PCD_BcdCallback(hal_pcd_handle_t *hpcd, hal_pcd_bcd_port_type_t port_type);
void HAL_PCD_ErrorCallback(hal_pcd_handle_t *hpcd);
void HAL_PCD_EndpointAbortTransferCallback(hal_pcd_handle_t *hpcd, uint8_t ep_num);

/**
  * @}
  */

/** @defgroup PCD_Exported_Functions_Group8 Register Callbacks functions
  * @{
  */
#if defined (USE_HAL_PCD_REGISTER_CALLBACKS) && (USE_HAL_PCD_REGISTER_CALLBACKS == 1U)
/* Register callbacks */
hal_status_t HAL_PCD_RegisterSofCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback);
hal_status_t HAL_PCD_RegisterSetupCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback);
hal_status_t HAL_PCD_RegisterResetCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback);
hal_status_t HAL_PCD_RegisterSuspendCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback);
hal_status_t HAL_PCD_RegisterResumeCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback);
hal_status_t HAL_PCD_RegisterConnectCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback);
hal_status_t HAL_PCD_RegisterDisconnectCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback);
hal_status_t HAL_PCD_RegisterDataOutStageCallback(hal_pcd_handle_t *hpcd, hal_pcd_data_cb_t p_callback);
hal_status_t HAL_PCD_RegisterDataInStageCallback(hal_pcd_handle_t *hpcd, hal_pcd_data_cb_t p_callback);
hal_status_t HAL_PCD_RegisterIsoOutIncpltCallback(hal_pcd_handle_t *hpcd, hal_pcd_iso_cb_t p_callback);
hal_status_t HAL_PCD_RegisterIsoInIncpltCallback(hal_pcd_handle_t *hpcd, hal_pcd_iso_cb_t p_callback);
hal_status_t HAL_PCD_RegisterErrorCallback(hal_pcd_handle_t *hpcd, hal_pcd_cb_t p_callback);
hal_status_t HAL_PCD_RegisterEndpointAbortTransferCallback(hal_pcd_handle_t *hpcd, hal_pcd_data_cb_t p_callback);
hal_status_t HAL_PCD_RegisterBcdCallback(hal_pcd_handle_t *hpcd, hal_pcd_bcd_cb_t p_callback);
hal_status_t HAL_PCD_RegisterLpmCallback(hal_pcd_handle_t *hpcd, hal_pcd_lpm_cb_t p_callback);
#endif /* USE_HAL_PCD_REGISTER_CALLBACKS */

/**
  * @}
  */

/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/

/**
  * @}
  */
#endif /* defined (USB_DRD_FS) */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* defined __cplusplus */

#endif /* STM32C5XX_HAL_PCD_H */
